module.exports = {
  routes: [
    {
      id: 1,
      from: {
        latitude: 24.285817,
        longitude: 109.476347
      },
      to: {
        latitude: 24.28691,
        longitude: 109.47655
      },
      waypoints: '24.284775,109.476173;24.284735,109.475942;24.285168,109.473286;24.284784,109.474467;24.284534,109.476015;24.283831,109.476008;24.283334,109.475899;24.281521,109.475553;24.280172,109.4753;24.279991,109.475644;24.27993,109.476054;24.27943,109.479066;24.28013,109.479446;24.283649,109.480104;24.285324,109.480412;24.286961,109.480747;24.287769,109.480907;24.287964,109.480508;24.288952,109.477146;24.288261,109.476819',
      waypointType:'7;10;8;5;7;11;4;3;6;5;10;6;12;9;2;5;7;10;6;11'
    },
    {
      id: 2,
      to: {
        latitude: 24.285817,
        longitude: 109.476347
      },
      from: {
        latitude: 24.28691,
        longitude: 109.47655
      },
      waypoints: '24.288287,109.476853;24.288806,109.477265;24.288405,109.478668;24.287839,109.480684;24.287494,109.480752;24.284947,109.48025;24.284221,109.480115;24.283769,109.480034;24.279576,109.479236;24.279546,109.478883;24.280123,109.475426;24.280419,109.475357;24.281005,109.475468;24.283831,109.476013;24.284417,109.476113;24.284738,109.4758;24.285157,109.473336;24.284686,109.475097;24.284545,109.475913', // 第二组途经点
      waypointType:'11;12;10;7;2;5;9;10;7;10;7;3;4;11;6;5;8;;6'
    },
    {
      id: 3,
      from: {
        latitude: 24.285817,
        longitude: 109.476347
      },
      to: {
        latitude: 24.28691,
        longitude: 109.47655
      },
      waypoints: '24.284761,109.476174;24.28447,109.476305;24.283899,109.479901;24.284239,109.478938;24.284686,109.476253;24.288262,109.476869;24.288817,109.476955;24.288822,109.477253;24.288362,109.478789;24.28783,109.480706;24.288116,109.480971;24.291347,109.481803;24.291648,109.481487;24.29283,109.478994;24.292313,109.478532;24.29195,109.478381;24.289836,109.477407;24.289106,109.477052;24.288137,109.476767',// 第三组途经点
      waypointType:'6;10;8;2;7;11;7;12;5;6;10;6;10;6;11;4;3;9;11'
    },
    {
      id: 4,
      from: {
        latitude: 24.31789,
        longitude: 109.365127
      },
      to: {
        latitude: 24.316073,
        longitude: 109.381086
      },
      waypoints: '24.317871,109.365405;24.315703,109.365632;24.315525,109.366913;24.315617,109.370274;24.315691,109.37374;24.315774,109.377505;24.315835,109.381222',
      waypointType:'2;3;4;5;6;7;8'
    },
    {
      id: 5,
      to: {
        latitude: 24.31789,
        longitude: 109.365127
      },
      from: {
        latitude: 24.316073,
        longitude: 109.381086
      },
      waypoints: '24.315907,109.380504;24.315909,109.380191;24.3159,109.378475;24.31583,109.376775;24.315755,109.373171;24.315703,109.370466;24.315616,109.366107;24.317734,109.365789',
      waypointType:'2;3;4;5;6;7;8;9'
    }
  ],
  mp3:[
    {
      id: 0,
      name:'终点',
      path:'/page/component/resources/audio/km3/stop.mp3'
    },{
      id: 1,
      name:'起点',
      path:'/page/component/resources/audio/km3/start.mp3'
    },{
      id: 2,
      name:'超车',
      path:'/page/component/resources/audio/km3/chaoche.mp3'
    },{
      id: 3,
      name:'会车',
      path:'/page/component/resources/audio/km3/huiche.mp3'
    },{
      id: 4,
      name:'直线行驶',
      path:'/page/component/resources/audio/km3/straight_line.mp3'
    },{
      id: 5,
      name:'变道',
      path:'/page/component/resources/audio/km3/change.mp3'
    },{
      id: 6,
      name:'左转弯',
      path:'/page/component/resources/audio/km3/turn_left.mp3'
    },{
      id: 7,
      name:'右转弯',
      path:'/page/component/resources/audio/km3/turn_right.mp3'
    },{
      id: 8,
      name:'掉头',
      path:'/page/component/resources/audio/km3/u-turn.mp3'
    },{
      id: 9,
      name:'直行',
      path:'/page/component/resources/audio/km3/straight.mp3'
    },{
      id: 10,
      name:'提速',
      path:'/page/component/resources/audio/km3/speedup.mp3'
    },{
      id: 11,
      name:'公交站',
      path:'/page/component/resources/audio/km3/bus.mp3'
    },{
      id: 12,
      name:'学校区域',
      path:'/page/component/resources/audio/km3/school.mp3'
    }
  ]
};
