{
  "examSites": [
    {
      "id": "1",
      "name": "柳州汉华科目三",
      "address": "柳州市柳南区柳工大道168号",
      "contact": "0772-1234567",
      "routeIds": [1, 2, 3]
    },{
      "id": "2",
      "name": "柳州春园福",
      "address": "柳州市柳南区柳工大道168号",
      "contact": "0772-1234567",
      "routeIds": [1, 2, 3]
    },{
      "id": "3",
      "name": "柳州市浩源",
      "address": "柳州市柳南区柳工大道168号",
      "contact": "0772-1234567",
      "routeIds": [1, 2, 3]
    },
    {
      "id": "999",
      "name": "测试线路",
      "address": "南宁市江南区那洪大道78号",
      "contact": "0771-7654321",
      "routeIds": [6,4, 5]
    }
    // 其他考场...
  ]
}
